package ar

import "github.com/imbue11235/humanize/locale"

// Code contains the locale code for danish locale
var Code = "ar"

// Locale contains the danish locale data
var Locale = locale.Map{
	"slice": locale.Map{
		"connector": "و",
		"rest":      "[1] واحد آخر‎ | [2-*] آخرون‎ %d ",
	},
	"time": locale.Map{
		"now":    "الآن",
		"future": "%s بعد",
		"past":   "%s قبل",
		"estimation": locale.Map{
			"s": "‎[1] ثانية‎ | [2]	ثانيتان‎ | [3-10] ثواني %d | [11-*] ثانية %d",
			"m": "‎[1]‎ دقيقة‎‎ | [2] دقيقتان‎ | [3-10] دقائق‎‎ %d | [11-*]‎ دقيقة‎ %d",
			"h": "[1] ساعة‎ | [2] سعاتان‎ | [3-10] ساعات‎ %d | [11-*] ساعة‎ %d",
			"d": "[1] يوم‎ | [2] يومان‎ | [3-10] ايام‎ %d | [11-*] يوم‎ %d",
			"w": "[1] اسبوع‎ | [2] اسبوعان‎ | [3-10] اسابيع‎ %d	| [11-*] اسبوع ‎%d",
			"M": "[1] شهر‎ | [2] ‎شهران‎ | [3-10] اشهر‎ %d | [11-*] شهر %d",
			"y": "[1] سنة‎ | [2] سنتان‎ | [3-10] سنين‎ %d‎‎ | [11-*] سنة‎ %d",
			"D": "[1] عقد‎ | [2] ‎عقدان‎ | [3-10] عقود‎ %d | [11-*] عقد‎ %d",
			"l": "وقت طويل",
		},‎‎
		"precision": locale.Map{
			"s": "‎[1] %d ثانية‎ | [2] %d ثانيتان‎ | [3-10] ثواني %d | [11-*] ثانية %d",
			"m": "‎[1]‎ %d دقيقة‎‎ | [2] %d دقيقتان‎ | [3-10] دقائق‎‎ %d | [11-*]‎ دقيقة‎ %d",
			"h": "[1] %d ساعة‎ | [2] %d سعاتان‎ | [3-10] ساعات‎ %d | [11-*] ساعة‎ %d",
			"d": "[1] %d يوم‎ | [2] %d يومان‎ | [3-10] ايام‎ %d | [11-*] يوم‎ %d",
			"M": "[1] %d شهر‎ | [2] %d ‎شهران‎ | [3-10] اشهر‎ %d | [11-*] شهر %d",
			"y": "[1] %d سنة‎ | [2] %d سنتان‎ | [3-10] سنين‎ %d‎‎ | [11-*] سنة‎ %d",
		},
	},
	"int": locale.Map{
		"K":  "[1] الف‎ | [2] الفان‎ | [3-*] الوف",
		"M":  "[1] مليون‎ | [2] مليونان‎‎ | [3-*] ملايين",
		"B":  "[1] مليار‎ | [2] ملياران‎ | [3-*] المليارات ",
		"T":  "[1] تريليون‎ | [2] تريليونان‎ | [3-*] تريليونات",
		"Q":  "[1] كوادريليون‎ | [2] كوادرليونان‎ | [3-*]  كوادرليونات‎",
		"Qi": "[1] ‎‎كوينتيليون‎ | [2] ‎‎كوينتيليونان‎ | [3-*] ‎‎كوينتيليونات‎‎ ",
		"Sx": "[1] سكستليون‎ | [2] ‎سكستليونان‎ | [3-*] سكستليونات",
		"Sp": "[1] سبتليون‎ | [2] سبتليونان‎ | [3-*] سبتليونات‎‎",
	},
}
