package ar

import "github.com/imbue11235/humanize/locale"

// Code contains the locale code for arabic locale
var Code = "ar"

// Locale contains the arabic locale data
var Locale = locale.Map{
	"slice": locale.Map{
		"connector": "و",
		"rest":      "[1] واحد آخر‎ | [2-*] آخرين‎ %d ",
	},
	"time": locale.Map{
		"now":    "الآن",
		"future": "%s بعد",
		"past":   "%s قبل",
		"estimation": locale.Map{
			"s": "‎[1] ثانية‎ | [2]	ثانيتين‎ | [3-10] ثوانٍ %d | [11-*] ثانية %d",
			"m": "‎[1]‎ دقيقة‎‎ | [2] دقيقتين‎ | [3-10] دقائق‎‎ %d | [11-*]‎ دقيقة‎ %d",
			"h": "[1] ساعة‎ | [2] سعتين‎ | [3-10] ساعات‎ %d | [11-*] ساعة‎ %d",
			"d": "[1] يوم‎ | [2] يومين‎ | [3-10] أيام‎ %d | [11-99] يوما‎ %d | [100-*] يوم ",
			"w": "[1] أسبوع‎ | [2] أسبوعين‎ | [3-10] أسابيع‎ %d | [11-99] أسبوعا ‎%d | [100-*] اسبوع",
			"M": "[1] شهر‎ | [2] ‎شهرين‎ | [3-10] أشهر‎ %d | [11-99] شهرا %d | [100-*] شهر",
			"y": "[1] سنة‎ | [2] سنتين‎ | [3-10] سنين‎ %d‎‎ | [11-*] سنة‎ %d",
			"D": "[1] عقد‎ | [2] ‎عقدين‎ | [3-10] عقود‎ %d | [11-99] عقدا %d | [100-*] عقد",
			"l": "وقت طويل",
		},
		"precision": locale.Map{
			"s": "‎[1] %d ثانية‎ | [2] %d ثانيتين‎ | [3-10] ثوانٍ %d | [11-*] ثانية %d",
			"m": "‎[1]‎ %d دقيقة‎‎ | [2] %d دقيقتين‎ | [3-10] دقائق‎‎ %d | [11-*]‎ دقيقة‎ %d",
			"h": "[1] %d ساعة‎ | [2] %d سعتين‎ | [3-10] ساعات‎ %d | [11-*] ساعة‎ %d",
			"d": "[1] %d يوم‎ | [2] %d يومين‎ | [3-10] أيام‎ %d | [11-99] يوما‎ %d | [100-*] يوم ",
			"M": "[1] %d شهر‎ | [2] %d ‎شهرين‎ | [3-10] أشهر‎ %d | [11-99] شهرا %d | [100-*] شهر",
			"y": "[1] %d سنة‎ | [2] %d سنتين‎ | [3-10] سنين‎ %d‎‎ | [11-*] سنة‎ %d",
		},
	},
	"int": locale.Map{
		"K":  "[1] ألف‎ | [2] ألفين‎ | [3-*] ألوف",
		"M":  "[1] مليون‎ | [2] مليونين‎‎ | [3-*] ملايين",
		"B":  "[1] مليار‎ | [2] مليارين‎ | [3-*] المليارات ",
		"T":  "[1] تريليون‎ | [2] تريليونين‎ | [3-*] تريليونات",
		"Q":  "[1] كوادريليون‎ | [2] كوادرليونين‎ | [3-*] كوادرليونات‎",
		"Qi": "[1] ‎‎كوينتيليون‎ | [2] ‎‎كوينتيليونين‎ | [3-*] ‎‎كوينتيليونات‎‎ ",
		"Sx": "[1] سكستليون‎ | [2] ‎سكستليونين‎ | [3-*] سكستليونات",
		"Sp": "[1] سبتليون‎ | [2] سبتليونين‎ | [3-*] سبتليونات‎‎",
	},
}
